In [32]:
import sqlite3

In [33]:
conn = sqlite3.connect('Thursday.sqlite')

In [34]:
cur = conn.cursor()

In [22]:
# conn.rollback()

In [35]:
cur.execute("""
    create table thursday (id int primary key not null, 
    name text not null,
    age int not null,
    address char(50) not null,
    marks int not null)
""")

In [36]:
cur.execute("""
    insert into thursday (id, name, age, address, marks) \
    values (2,'Allen',14, 'Bangalore', 150) 
""")
cur.execute("""
    insert into thursday (id, name, age, address, marks) \
    values (1,'Dude',12, 'Denver', 140) 
""")
cur.execute("""
    insert into thursday (id, name, age, address, marks) \
    values (3,'Dwight',16, 'Boston', 179) 
""")
cur.execute("""
    insert into thursday (id, name, age, address, marks) \
    values (4,'David',17, 'New York City', 153) 
""")
cur.execute("""
    insert into thursday (id, name, age, address, marks) \
    values (5,'Dwight', 12, 'Manchester', 145) 
""")
conn.commit()

In [44]:
for row in cur.execute("""
    SELECT id, name, age, address, marks
    FROM thursday 
    """):
    print(f"ID = {row[0]}")
    print(f"Name = {row[1]}")
    print(f"Age = {row[2]}")
    print(f"Address = {row[3]}")
    print(f"Marks = {row[4]} \n")
conn.commit()

ID = 2
Name = Allen
Age = 14
Address = Bangalore
Marks = 150

ID = 1
Name = Dude
Age = 12
Address = Denver
Marks = 140

ID = 3
Name = Dwight
Age = 16
Address = Boston
Marks = 179

ID = 4
Name = David
Age = 17
Address = New York City
Marks = 153

ID = 5
Name = Dwight
Age = 12
Address = Manchester
Marks = 145